finance/finance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2017-12-25 Mon 17:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Financial Market</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="finance" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Financial Market</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1332f9a">1. Conceptions</a>
<ul>
<li><a href="#orgc54592d">1.1. VAR(value at risk)</a></li>
<li><a href="#orge890d42">1.2. Stress Tests</a></li>
<li><a href="#org7011320">1.3. Cauchy Distribution</a></li>
<li><a href="#org3c22638">1.4. Random Walk</a></li>
</ul>
</li>
<li><a href="#org8b7fcab">2. Strategy Benchmark</a>
<ul>
<li><a href="#orgd0e094c">2.1. Expected return</a></li>
<li><a href="#orgea6a9a8">2.2. Daily return</a></li>
<li><a href="#org9d86fcb">2.3. Sharpe ratio</a></li>
<li><a href="#orgeacf173">2.4. Sortino ratio</a></li>
<li><a href="#org207afde">2.5. Max drawdown</a></li>
<li><a href="#orgb1b28fb">2.6. Jensen's alpha</a></li>
</ul>
</li>
<li><a href="#org9ec85c0">3. Company Value</a>
<ul>
<li><a href="#org5cefbf6">3.1. Market Capital</a></li>
<li><a href="#orgf1923a1">3.2. Discount Ratio(present value)</a></li>
<li><a href="#orgfc7fe93">3.3. Book Value</a></li>
<li><a href="#org9d455ea">3.4. Gordon Model</a></li>
</ul>
</li>
<li><a href="#orgaa0fe96">4. CAPM</a>
<ul>
<li><a href="#orgc764a1e">4.1. Return on stock has two components</a></li>
<li><a href="#orgdcf0ed8">4.2. Market return</a></li>
</ul>
</li>
<li><a href="#orgc2338be">5. Efficient Markets Hypothesis</a>
<ul>
<li><a href="#org888c8cb">5.1. Weak</a></li>
<li><a href="#orgac89e23">5.2. Semi-Strong</a></li>
<li><a href="#org7f58f3b">5.3. Strong</a></li>
</ul>
</li>
<li><a href="#org4f58e4b">6. Analysis</a>
<ul>
<li><a href="#org00e29ba">6.1. Technical Analysis</a></li>
<li><a href="#org545aa26">6.2. Fundamental Analysis</a></li>
</ul>
</li>
<li><a href="#org33dfcc5">7. Information Source</a></li>
<li><a href="#orgeca38a1">8. Insurance</a>
<ul>
<li><a href="#org6359582">8.1. Risk Pooling</a></li>
</ul>
</li>
<li><a href="#org7f00823">9. Bonds</a>
<ul>
<li><a href="#org350ab18">9.1. Inflation-indexed Debt</a></li>
</ul>
</li>
<li><a href="#org0edbcec">10. Money</a>
<ul>
<li><a href="#org1c62d24">10.1. Three functions it provides:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1332f9a" class="outline-2">
<h2 id="org1332f9a"><span class="section-number-2">1</span> Conceptions</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc54592d" class="outline-3">
<h3 id="orgc54592d"><span class="section-number-3">1.1</span> VAR(value at risk)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Value at risk</b> is usually quoted in units of $ for a given probability and time horizon
</p>

<p>
Ex: 1% one-year VAR of $10 million means 1% chance that a portfolio will lose $10 million in a year
</p>
</div>
</div>

<div id="outline-container-orge890d42" class="outline-3">
<h3 id="orge890d42"><span class="section-number-3">1.2</span> Stress Tests</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The stress test is a test usually ordered by government to see
how some firm will stand up to a financial crisis.
</p>
</div>
</div>

<div id="outline-container-org7011320" class="outline-3">
<h3 id="org7011320"><span class="section-number-3">1.3</span> Cauchy Distribution</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Fat-tailed
</p>
</div>
</div>

<div id="outline-container-org3c22638" class="outline-3">
<h3 id="org3c22638"><span class="section-number-3">1.4</span> Random Walk</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\[x_t=x_{t-1}+\varepsilon_t\]
</p>
</div>
<div id="outline-container-orgc14e0e6" class="outline-4">
<h4 id="orgc14e0e6"><span class="section-number-4">1.4.1</span> First-order autoregressive(AR-1) Model</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
\[x_t=100+\rho(x_{t-1}-100)+\varepsilon_t\]
Mean reverting (to 100), \(-1<\rho <1\)
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8b7fcab" class="outline-2">
<h2 id="org8b7fcab"><span class="section-number-2">2</span> Strategy Benchmark</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd0e094c" class="outline-3">
<h3 id="orgd0e094c"><span class="section-number-3">2.1</span> Expected return</h3>
<div class="outline-text-3" id="text-2-1">
<p>
\[return = \frac{value_{end}}{value_{start}} - 1 \]
</p>
</div>
<div id="outline-container-org08327d7" class="outline-4">
<h4 id="org08327d7"><span class="section-number-4">2.1.1</span> long-period return 2 short-period avg return(using geomean)</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Number of period is denoted by <b>n</b>.
\[short\_avg = \sqrt[n]{1+total\_return} - 1\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgea6a9a8" class="outline-3">
<h3 id="orgea6a9a8"><span class="section-number-3">2.2</span> Daily return</h3>
<div class="outline-text-3" id="text-2-2">
<p>
\[rets_i = \frac{value_i}{value_{i-1}} - 1 \]
</p>
</div>
</div>

<div id="outline-container-org9d86fcb" class="outline-3">
<h3 id="org9d86fcb"><span class="section-number-3">2.3</span> Sharpe ratio</h3>
<div class="outline-text-3" id="text-2-3">
<p>
\[Sharpe = \frac{E - R_f}{\sigma} \]
</p>
<ul class="org-ul">
<li>\(R_f\): risk free return</li>
</ul>
</div>
<div id="outline-container-orgfb155d3" class="outline-4">
<h4 id="orgfb155d3"><span class="section-number-4">2.3.1</span> from period returns</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
\[Sharpe = sqrt(k) * \frac{mean(period\_rets)}{std(period\_rets)}\]
</p>
<ul class="org-ul">
<li>k: trading periods in one year. 250 for days, 12 for month</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeacf173" class="outline-3">
<h3 id="orgeacf173"><span class="section-number-3">2.4</span> Sortino ratio</h3>
<div class="outline-text-3" id="text-2-4">
<p>
only count volatility when it's downward
</p>
</div>
</div>

<div id="outline-container-org207afde" class="outline-3">
<h3 id="org207afde"><span class="section-number-3">2.5</span> Max drawdown</h3>
</div>
<div id="outline-container-orgb1b28fb" class="outline-3">
<h3 id="orgb1b28fb"><span class="section-number-3">2.6</span> Jensen's alpha</h3>
</div>
</div>
<div id="outline-container-org9ec85c0" class="outline-2">
<h2 id="org9ec85c0"><span class="section-number-2">3</span> Company Value</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5cefbf6" class="outline-3">
<h3 id="org5cefbf6"><span class="section-number-3">3.1</span> Market Capital</h3>
</div>
<div id="outline-container-orgf1923a1" class="outline-3">
<h3 id="orgf1923a1"><span class="section-number-3">3.2</span> Discount Ratio(present value)</h3>
</div>
<div id="outline-container-orgfc7fe93" class="outline-3">
<h3 id="orgfc7fe93"><span class="section-number-3">3.3</span> Book Value</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A company's book value is its total assets minus intangible assets and liabilities
</p>
</div>
</div>

<div id="outline-container-org9d455ea" class="outline-3">
<h3 id="org9d455ea"><span class="section-number-3">3.4</span> Gordon Model</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The idea is the price of stock should be the present discount value of expected dividends.
</p>
<ul class="org-ul">
<li>if earning equal dividends and if dividends grow at long-run rate \(g\), then by growing</li>
</ul>
<p>
consol model \(P=\frac{E}{r-g}\), \(P/E=\frac{1}{r-g}\) (\(r\) for discount rate)
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa0fe96" class="outline-2">
<h2 id="orgaa0fe96"><span class="section-number-2">4</span> CAPM</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc764a1e" class="outline-3">
<h3 id="orgc764a1e"><span class="section-number-3">4.1</span> Return on stock has two components</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\[r_i = \beta_i \cdot r_m + \alpha_i\]
</p>
</div>
<div id="outline-container-org07acb51" class="outline-4">
<h4 id="org07acb51"><span class="section-number-4">4.1.1</span> Systematic(the market) \(\beta\)</h4>
</div>
<div id="outline-container-org704e133" class="outline-4">
<h4 id="org704e133"><span class="section-number-4">4.1.2</span> Residual \(\alpha\)</h4>
</div>
</div>
<div id="outline-container-orgdcf0ed8" class="outline-3">
<h3 id="orgdcf0ed8"><span class="section-number-3">4.2</span> Market return</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Risk free rate of return + excess return
</p>
</div>
</div>
</div>
<div id="outline-container-orgc2338be" class="outline-2">
<h2 id="orgc2338be"><span class="section-number-2">5</span> Efficient Markets Hypothesis</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org888c8cb" class="outline-3">
<h3 id="org888c8cb"><span class="section-number-3">5.1</span> Weak</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Current prices reflect all past publicly available information.
</p>
<ul class="org-ul">
<li>Prohibits profit from T.A</li>
</ul>
</div>
</div>
<div id="outline-container-orgac89e23" class="outline-3">
<h3 id="orgac89e23"><span class="section-number-3">5.2</span> Semi-Strong</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Weak + prices instantly change to reflect new public information
</p>
<ul class="org-ul">
<li>Prohibits profit from T.A &amp; F.A</li>
</ul>
</div>
</div>
<div id="outline-container-org7f58f3b" class="outline-3">
<h3 id="org7f58f3b"><span class="section-number-3">5.3</span> Strong</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Semi-Strong + prices instantly reflect even hidden or "insider" information
</p>
<ul class="org-ul">
<li>Prohibits profit from insider information</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4f58e4b" class="outline-2">
<h2 id="org4f58e4b"><span class="section-number-2">6</span> Analysis</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org00e29ba" class="outline-3">
<h3 id="org00e29ba"><span class="section-number-3">6.1</span> Technical Analysis</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Prices and volume only</li>
</ul>
</div>
</div>
<div id="outline-container-org545aa26" class="outline-3">
<h3 id="org545aa26"><span class="section-number-3">6.2</span> Fundamental Analysis</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Financial statements</li>
<li>P/E ratios, cash on hand, dividends</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org33dfcc5" class="outline-2">
<h2 id="org33dfcc5"><span class="section-number-2">7</span> Information Source</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Price/Volume: The markets</li>
<li>Fundamental: SEC filings</li>
<li>News: Exogenous sources</li>
</ul>
</div>
</div>
<div id="outline-container-orgeca38a1" class="outline-2">
<h2 id="orgeca38a1"><span class="section-number-2">8</span> Insurance</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6359582" class="outline-3">
<h3 id="org6359582"><span class="section-number-3">8.1</span> Risk Pooling</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<b>Risk Pooling</b> is the source of all value in insurance.
</p>

<p>
If <b>n</b> policies, each has independent probability <b>p</b> of a claim,
then the number of claims follows the binomial distribution. The
standard deviation of the fraction of policies that result in a claim is
\(\frac{\sqrt{np(1-p)}}{n}=\sqrt{\frac{p(1-p)}{n}}\)
</p>
</div>
</div>
</div>
<div id="outline-container-org7f00823" class="outline-2">
<h2 id="org7f00823"><span class="section-number-2">9</span> Bonds</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org350ab18" class="outline-3">
<h3 id="org350ab18"><span class="section-number-3">9.1</span> Inflation-indexed Debt</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>eg: TIPS(iShares TIPS Bond ETF)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0edbcec" class="outline-2">
<h2 id="org0edbcec"><span class="section-number-2">10</span> Money</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org1c62d24" class="outline-3">
<h3 id="org1c62d24"><span class="section-number-3">10.1</span> Three functions it provides:</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>a store of value</li>
<li>a unit of account</li>
<li>a medium of transaction</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
